# Pandas - Missing Data

In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A':[1,2,np.nan], 'B':[4,np.nan, np.nan], 'C':[7,8,9]}

In [3]:
df = pd.DataFrame(data=d)

In [4]:
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [5]:
df1 = pd.Series(data=d)

In [6]:
df1

A      [1, 2, nan]
B    [4, nan, nan]
C        [7, 8, 9]
dtype: object

In [7]:
df.dropna()

     A    B  C
0  1.0  4.0  7

In [8]:
df.dropna(axis=1)

   C
0  7
1  8
2  9

In [9]:
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [10]:
df.dropna(axis=1, thresh=2)

     A  C
0  1.0  7
1  2.0  8
2  NaN  9

In [11]:
df.fillna(value="Fill NAN")

          A         B  C
0       1.0       4.0  7
1       2.0  Fill NAN  8
2  Fill NAN  Fill NAN  9

In [12]:
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [14]:
df['A'].fillna(value=df.A.mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64